src/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_СтруктураПредприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/МобильноеПриложениеВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиентаПриЗапуске.
//
Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	ТребуетсяОбновлениеИнтерфейса = Ложь;
	УстановитьВернутьОграничениеПоТарификацииЕслиНужно(ТребуетсяОбновлениеИнтерфейса = Ложь);
	Параметры.Вставить("УстановленСоставФормТребуетсяОбновлениеИнтерфейса", ТребуетсяОбновлениеИнтерфейса);
	
КонецПроцедуры

// Запускается при начале работы клиента. Устанавливает ограничения по тарификации.
//
Процедура УстановитьВернутьОграничениеПоТарификацииЕслиНужно(ТребуетсяОбновлениеИнтерфейса = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивПользователей = ПолучитьМассивПользователей();
	
	ЕстьОграничениеМобильногоУНФ = ЕстьОграничениеМобильногоУНФ() И НЕ ЕстьПробныйПериод();
	Если ЕстьОграничениеМобильногоУНФ <> ЭтоМобильноеПриложение() Тогда
		УстановитьЭтоМобильноеПриложение(ЕстьОграничениеМобильногоУНФ);
		// Устанавливаем/снимаем ограничения
		Если ЕстьОграничениеМобильногоУНФ Тогда
			УстановитьМинимальныйИнтерфейс(МассивПользователей);
		Иначе
			УстановитьОбычныйИнтерфейс(МассивПользователей);
		КонецЕсли;
		УстановитьСоставФормДляПользователей(МассивПользователей, ТребуетсяОбновлениеИнтерфейса);
	КонецЕсли;
	
	ЕстьОграничениеМобильногоУНФ20 = ЕстьОграничениеМобильногоУНФ20() И НЕ ЕстьПробныйПериод();
	Если ЕстьОграничениеМобильногоУНФ20 <> ЭтоМобильноеПриложение20() Тогда
		УстановитьЭтоМобильноеПриложение20(ЕстьОграничениеМобильногоУНФ20);
		// Устанавливаем/снимаем ограничения
		Если ЕстьОграничениеМобильногоУНФ20 Тогда
			УстановитьМинимальныйИнтерфейс(МассивПользователей);
		Иначе
			УстановитьОбычныйИнтерфейс(МассивПользователей);
		КонецЕсли;
		УстановитьСоставФормДляПользователей(МассивПользователей, ТребуетсяОбновлениеИнтерфейса);
	КонецЕсли;
	
КонецПроцедуры

Функция ЕстьОграничениеМобильногоУНФ20() Экспорт
	
	Если РаботаВМоделиСервиса.РазделениеВключено()
		И ИспользоватьКонтрольТарификации() Тогда
		Возврат Тарификация.ЗарегистрированаЛицензияБезлимитнойУслуги(ИдентификаторПоставщикаУслугМобильногоПриложения(), ИдентификаторУслугиОграниченияМобильногоПриложения20());
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Функция ЕстьОграничениеМобильногоУНФ() Экспорт
	
	Если РаботаВМоделиСервиса.РазделениеВключено()
		И ИспользоватьКонтрольТарификации() Тогда
		Возврат Тарификация.ЗарегистрированаЛицензияБезлимитнойУслуги(ИдентификаторПоставщикаУслугМобильногоПриложения(), ИдентификаторУслугиОграниченияМобильногоПриложения());
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЕстьПробныйПериод() Экспорт
	
	Если РаботаВМоделиСервиса.РазделениеВключено()
		И ИспользоватьКонтрольТарификации() Тогда
		Возврат Тарификация.ЗарегистрированаЛицензияБезлимитнойУслуги(ИдентификаторПоставщикаУслугМобильногоПриложения(), ИдентификаторУслугиПробныйПериод());
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Возвращает признак того, что эта информационная база работает в режиме ограниченной функциональности.
//
Функция ЭтоМобильноеПриложение() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ЭтоМобильноеПриложение.Получить();
	
КонецФункции   

Функция ЭтоМобильноеПриложение20() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ЭтоМобильноеПриложение20.Получить();
	
КонецФункции

// Возвращает признак того, что эта информационная база работает в режиме ограниченной функциональности.
//
Функция НужноОграничитьФункциональность() Экспорт
	
	Возврат ЭтоМобильноеПриложение();
	
КонецФункции

Функция НужноОграничитьФункциональность20() Экспорт
	
	Возврат ЭтоМобильноеПриложение20();
	
КонецФункции

Функция ПолучитьМассивПользователей() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.ИдентификаторПользователяИБ
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.Служебный
	|	И Пользователи.ИдентификаторПользователяИБ <> &ПустойИД
	|	И НЕ Пользователи.ПометкаУдаления";
	Запрос.УстановитьПараметр("ПустойИД", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	ТаблицаРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	
	МассивПользователей = ТаблицаРезультатаЗапроса.ВыгрузитьКолонку("ИдентификаторПользователяИБ");
	
	Возврат МассивПользователей;

КонецФункции

Процедура УстановитьСоставФормДляПользователей(МассивПользователей, ТребуетсяОбновлениеИнтерфейса) Экспорт
	
	Для каждого ТекПользователь Из МассивПользователей Цикл
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекПользователь);
		Если ПользовательИБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		РабочийСтолУНФ.УстановитьСоставФорм(ТребуетсяОбновлениеИнтерфейса, ПользовательИБ.Имя);
	КонецЦикла;
	
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	РабочийСтолУНФ.УстановитьСоставФорм(ТребуетсяОбновлениеИнтерфейса, ИмяПользователя);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УстановитьЭтоМобильноеПриложение(Знач Значение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.ЭтоМобильноеПриложение.Установить(Значение);
	Константы.ЭтоОбычноеПриложение.Установить(НЕ Значение);
	Если Значение Тогда
		Константы.ЭтоМобильноеПриложение20.Установить(Ложь);
	КонецЕсли;
	
КонецФункции

Функция УстановитьЭтоМобильноеПриложение20(Знач Значение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.ЭтоМобильноеПриложение20.Установить(Значение);
	Константы.ЭтоОбычноеПриложение.Установить(НЕ Значение);
	Если Значение Тогда
		Константы.ЭтоМобильноеПриложение.Установить(Ложь);
	КонецЕсли;
	
КонецФункции

Процедура УстановитьОбычныйИнтерфейс(МассивПользователей) Экспорт
	
	Для каждого ТекПользователь Из МассивПользователей Цикл
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекПользователь);
		Если ПользовательИБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", Неопределено,, ПользовательИБ.Имя);
	КонецЦикла;
	
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", Неопределено,, ИмяПользователя);
	
КонецПроцедуры 

Процедура УстановитьМинимальныйИнтерфейс(МассивПользователей) Экспорт

	Настройки = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	НастройкиСостава = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	Настройки.УстановитьСостав(НастройкиСостава);
	
	Для каждого ТекПользователь Из МассивПользователей Цикл
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекПользователь);
		Если ПользовательИБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", Настройки,, ПользовательИБ.Имя);
	КонецЦикла;
	
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", Настройки,, ИмяПользователя);

КонецПроцедуры

Процедура СервисныеОперацииМобильногоПриложения() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МобильноеПриложение.Ссылка,
	|	МобильноеПриложение.ДатаПоследнейСинхронизации
	|ИЗ
	|	ПланОбмена.МобильноеПриложение КАК МобильноеПриложение
	|ГДЕ
	|	МобильноеПриложение.ДатаПоследнейСинхронизации <= &ДатаПоследнейСинхронизации";
	
	Запрос.УстановитьПараметр("ДатаПоследнейСинхронизации", ТекущаяДатаСеанса() - 86400);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ДатаПоследнейСинхронизации) Тогда
			ОбменМобильноеПриложениеОбщее.ОчиститьОчередьСообщенийОбменаСМобильнымКлиентом(Выборка.Ссылка);
		Иначе
			УстановитьПривилегированныйРежим(Истина);
			Попытка
				Узел = Выборка.Ссылка.ПолучитьОбъект();
				Узел.ДатаПоследнейСинхронизации = ТекущаяДатаСеанса();
				Узел.Записать();
			Исключение
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Мобильное приложение.Установка даты последней синхронизации в регламентном задании'"),
					УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			КонецПопытки;
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// См. ТарификацияПереопределяемый.ПриФормированииСпискаУслуг.
//
Процедура ПриФормированииСпискаУслуг(ПоставщикиУслуг) Экспорт
	
	МассивУслуг = Новый Массив;
	
	Услуга = Новый Структура;
	Услуга.Вставить("Идентификатор", ИдентификаторУслугиОграниченияМобильногоПриложения20());
	Услуга.Вставить("Наименование", "Ограничения мобильного приложения 1С:УНФ 2.0");
	Услуга.Вставить("ТипУслуги", Перечисления.ТипыУслуг.Безлимитная);
	МассивУслуг.Добавить(Услуга);
	
	Услуга = Новый Структура;
	Услуга.Вставить("Идентификатор", ИдентификаторУслугиОграниченияМобильногоПриложения());
	Услуга.Вставить("Наименование", "Ограничения мобильного приложения 1С:УНФ");
	Услуга.Вставить("ТипУслуги", Перечисления.ТипыУслуг.Безлимитная);
	МассивУслуг.Добавить(Услуга);
	
	Услуга = Новый Структура;
	Услуга.Вставить("Идентификатор", ИдентификаторУслугиПробныйПериод());
	Услуга.Вставить("Наименование", "Пробный период 1С:УНФ");
	Услуга.Вставить("ТипУслуги", Перечисления.ТипыУслуг.Безлимитная);
	МассивУслуг.Добавить(Услуга);
	
	НовыйПоставщикУНФ = Новый Структура;
	НовыйПоставщикУНФ.Вставить("Идентификатор", ИдентификаторПоставщикаУслугМобильногоПриложения());
	НовыйПоставщикУНФ.Вставить("Наименование", "1С:УНФ на мобильном");
	НовыйПоставщикУНФ.Вставить("Услуги", МассивУслуг);
	
	ПоставщикиУслуг.Добавить(НовыйПоставщикУНФ);
	
КонецПроцедуры  

Функция ИдентификаторУслугиОграниченияМобильногоПриложения20()
	
	Возврат "ОграниениеМПУНФ20";
	
КонецФункции

Функция ИдентификаторУслугиОграниченияМобильногоПриложения()
	
	Возврат "ОграниениеМПУНФ";
	
КонецФункции

Функция ИдентификаторУслугиПробныйПериод() Экспорт
	
	Возврат "ПробныйПериод";
	
КонецФункции

Функция ИдентификаторПоставщикаУслугМобильногоПриложения()
	
	Возврат "1С_МПУНФ";
	
КонецФункции

// Возвращает значение константы "ИспользоватьКонтрольТарификации".
//
// Параметры:
//  Булево - Истина, если включена тарификация, Ложь - иначе.
//
Функция ИспользоватьКонтрольТарификации()
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ИспользоватьКонтрольТарификации.Получить();
	
КонецФункции

#КонецОбласти
